Revit 2026 API

# RebarSpliceGeometry Class

---

This class consists of a vector and a point which will be projected to the nearest Rebar curve.

SystemObject Autodesk.Revit.DB.StructureRebarSpliceGeometry

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class RebarSpliceGeometry : IDisposable
```
```vb
Public Class RebarSpliceGeometry
	Implements IDisposable
```
```cpp
public ref class RebarSpliceGeometry : IDisposable
```
```fsharp
type RebarSpliceGeometry =
    class
        interface IDisposable
    end
```

The RebarSpliceGeometry type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | RebarSpliceGeometry | Constructs a RebarSpliceGeometry. |

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | SpliceNormal | Identifies the splice face normal. |
|  | SpliceOrigin | Identifies the splice face origin. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the RebarSpliceGeometry |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

The splice will be done with a plane that contains this point and has the normal the provided vector.

If this plane is intersecting other Rebar curves these intersection will not be taken into account.

#### Reference

Autodesk.Revit.DB.Structure Namespace